#include <iostream>
using namespace std;
int main() {
	//Напишите программу, которая проверяет жив ли персонаж в игре.
	//Если здоровье(hp) равно или меньше нуля, то выведите false, в противном случае true.
	//Входные данные : Вводится одно целое число — текущее здоровье персонажа.
	//Входные данные : Выведите логическую константу true или false.
//int hp;
//cin >> hp;
//bool res = hp > 0;
//cout << boolalpha << res << endl;


//system ("pause"); кондиционер включается, если в комнате температура больше 20 градусов; если же температура 20 градусов или ниже, кондиционер выключается.
//Напишите программу, которая определит, что будет делать кондиционер.r
	//Входные данные : Вводится одно целое число — текущая температура в комнате.
	//Входные данные : Выведите строку on, если кондиционер включится, и off, если выключится.
	//int b;
//cin >> b;
//if (b > 20) { cout << "on" << endl; }
//else {cout << "off" << endl; }
	//system("pause");


//Новая модель кондиционера учитывает еще и влажность в помещении.
//Поскольку при охлаждении влажность повышается, то кондиционер ни в коем случае не включается, если влажность в помещении превышает 80 % .
	//Кроме того, на этом кондиционере требуемую температуру можно настраивать с пульта.
//Таким образом, если пользователь выставил с пульта температуру T  градусов, то кондиционер включается, если температура в комнате строго больше T, а влажность 80 % или ниже.
//Если же хотя бы одно из условий не выполняется, то кондиционер выключается.
	//Входные данные : На одной строке вводятся три целых числа — выставленная пользователем температура T, текущая температура в комнате и текущая влажность в комнате.
//Температуры указаны в градусах, влажность — в процентах.
	//Входные данные : Выведите строку on, если кондиционер включится, и off, если выключится.
	//int a, G, b;
	//cin >> G >> a >> b;
	//if (a > G && b <= 80) { cout << "on" << endl; }
	//else { cout << "off" << endl; }
	//system("pause");

	//Требуется написать программу, вычисляющую значение функции у = f(x) :
	//у = х - 2, если x > 0,
	//y = 0, если x = 0,
	//y = | x | , если x < 0.
		//Входные данные : одно вещественное число, х
		//Выходные данные : одно вещественное число, y
	//int y, x;
	//cin >> x,y;
	//if (x > 0) { y = sqrt(x - 2); cout << y << endl; }
	//else if (x == 0) { y = 0; cout << y << endl; }
	//else if (x < 0) { y = abs(x); cout << y << endl; }
	//system("pause");


	//Пользователь вводит порядковый номер пальца руки(за 1й примем большой палец и т.д.).Необходимо вывести его название на экран.Если номер неправильный - вывести “error”.
	//Входные данные : одно целое число - номер пальца
	//case 2: cout << "средний" << endl; break;
	//case 2: cout << "указательный" << endl; brea
	//Выходные данные : строка с названием пальца или строка “ошибка”(можно вывести “error”, если не помните как подключить русские буквы)
	//int number;
	//cin >> number;
	//switch (number) {
	//case 1: cout << "большой" << endl; break;k;
	//case 4: cout << "средний" << endl; break;
	//case 5: cout << "мизинец" << endl; break;
	//deafault: cout << "ошибка" << endl;
	//}
	//system("pause");
 }